/*
  SkypeWiFi.strings
  Skype WiFi

  Created by John Chang on 2012-06-05.
  Copyright (c) 2012 Skype. All rights reserved.
*/

/* === All clients === */

"INTRO_HEADER" = "Esittelyssä Skype WiFi";
"INTRO_SUBHEADER" = "Käytä nettiä julkisten WiFi-hotspottien avulla ja maksa Skype-saldolla vain käyttämästäsi yhteysajasta.";
"INTRO_ICON_WIFI" = "Käytä Skypeä, lue sähköposteja ja surfaa netissä.";
"INTRO_ICON_GLOBE" = "Skype WiFi toimii yli miljoonassa paikassa eri puolilla maailmaa.";
"INTRO_ICON_SKYPECREDIT" = "Maksa minuuttiveloitus vain käyttämästäsi ajasta.";

"STATE_CHECKINGNETWORK_HEADER" = "Odota hetki…";
"STATE_CHECKINGNETWORK_SUBHEADER" = "Tarkistetaan, onko verkossa Skype WiFiä";

"STATE_JOINWIFI_HEADER" = "Et ole yhteydessä WiFi-verkkoon";
"STATE_JOINWIFI_SUBHEADER" = "Yhdistä julkiseen WiFi-verkkoon, joka tukee Skype WiFiä.";

"STATE_ALREADYONLINE_HEADER" = "Sinulla on jo nettiyhteys";
"STATE_ALREADYONLINE_SUBHEADER" = "Näyttäisi siltä, että nettiyhteytesi toimii jo. Skype WiFin avulla sinulla on käytössäsi nopea nettiyhteys yli miljoonasta WiFi-hotspotista ympäri maailmaa.";

"STATE_GENERALERROR_HEADER" = "Yhteyden luominen epäonnistui";
"STATE_GENERALERROR_SUBHEADER" = "Tämä WiFi-verkko ei vastaa oikein. Yritä muodostaa yhteys johonkin toiseen verkkoon.";

"STATE_CONNECT_HEADER" = "Skype WiFi toimii täällä";
"STATE_CONNECT_TOS_HTML_FORMAT" = "Kun muodostat yhteyden, hyväksyt yhteydentarjoajan <a href=\"%@\">palveluehdot</a>";

"STATE_CONNECT_BUTTON" = "Yhdistä";
"STATE_CONNECTING_BUTTON" = "Yhdistetään…";

"STATE_CONNECTED_SHORT" = "Yhteys muodostettu";
"STATE_CONNECTED_HEADER" = "Olet muodostanut nettiyhteyden Skype WiFin avulla";

"STATE_CONNECTED_DISCONNECT_BUTTON" = "Katkaise yhteys";
"STATE_DISCONNECTING_BUTTON" = "Yhteyttä katkaistaan…";

"STATE_NOCREDIT_HEADER" = "Ei tarpeeksi Skype-saldoa";


/* === Mac only === */

"OK_BUTTON" = "OK";
"LEARNMORE_BUTTON" = "Lisätietoja";
"CLOSE_BUTTON" = "Sulje";
"GO_BACK_BUTTON" = "Takaisin";
"CONTINUE_BUTTON" = "Jatka";

"REQUIRES_OSX_VERSION_MESSAGE" = "Skype WiFi vaatii OS X %@:n tai uudemman.";

/* if partner is PARTNER_MICROSOFT and account name does not start with "live:" then its a linked account */
"NOT_SUPPORTED_LINKED_ACCOUNT" = "Skype WiFiä ei voi vielä käyttää Microsoft-tilillä. Kirjaudu sisään Skype-nimelläsi ja -salasanallasi.";
/* if the partner is PARTNER_MICROSOFT and account name does start with "live:" then its pure MS account login */
"NOT_SUPPORTED_MICROSOFT_ACCOUNT" = "Skype WiFiä ei voi vielä käyttää Microsoft-tilillä. Luo Skype-tili ja kirjaudu sisään sen avulla.";

"MAIN_WINDOW_TITLE" = "Skype WiFi";
"MAIN_WINDOW_TITLE_WITH_SSID" = "Skype WiFi — %@";

"FLOATER_CONNECTED_TITLE" = "Olet muodostanut nettiyhteyden Skype WiFin avulla";
"FLOATER_CONNECTED_WISPR_TITLE" = "Sinulla on nyt nettiyhteys";
"FLOATER_CONNECTED_EXPIRES_SOON_TITLE" = "Yhteys katkeaa pian";

"SETTINGS_CONNECTION_LENGTH_POPOVER_TEXT" = "Yhteys aikakatkaistaan turvallisuussyistä automaattisesti, jos olet muodostanut yhteyden Skype-saldolla ja olet unohtanut katkaista yhteyden.";
"SETTINGS_SESSION_LENGTH_NMIN_FORMAT" = "%d minuuttia";

"STATE_CONNECT_SUBHEADER" = "Käytä tämän verkon nettiyhteyttä Skype WiFin avulla ja maksa Skype-saldolla vain käyttämästäsi yhteysajasta.";
"STATE_CONNECT_FREE_HEADER" = "Skype WiFi on täällä ilmainen";
"STATE_CONNECT_FREE_SUBHEADER" = "Voit käyttää tämän hotspotin nettiyhteyttä ilmaiseksi Skype WiFin avulla. Voit tarkistaa sähköpostisi, surffata netissä tai käyttää Skypeä.";
"STATE_CONNECT_WISPR_HEADER" = "Minulla on tältä palveluntarjoajalta saatu tili";
"STATE_CONNECT_WISPR_SUBHEADER" = "Jos sinulla on jo tämän palveluntarjoajan tili, anna kirjautumistietosi tässä.";

"STATE_CONNECTED_EXPIRES_SOON_HEADER" = "Nettiyhteytesi vanhenee pian";
"STATE_CONNECTED_SUBHEADER_FORMAT" = "%@ Voit katkaista yhteyden milloin tahansa, ja sinua veloitetaan vain käyttämästäsi ajasta.";
"STATE_CONNECTED_FREE_SUBHEADER_FORMAT" = "%@";
"COUNTUP_NMIN_FORMAT" = "Olet ollut netissä noin %d minuutin ajan.";
"COUNTUP_0MIN" = "Olet ollut netissä alle minuutin ajan.";
"COUNTUP_1MIN" = "Olet ollut netissä noin minuutin ajan.";
"STATE_CONNECTED_WISPR_HEADER" = "Sinulla on nyt nettiyhteys";
"STATE_CONNECTED_WISPR_SUBHEADER" = "Sinut yhdistetään tämän hotspot-palvelun tilisi kautta. Voit katkaista yhteyden milloin tahansa.";
"STATE_CONNECTED_RATE_THIS_HOTSPOT" = "Arvioi tämä hotspot";

"STATE_CONNECTED_EXTEND_BUTTON" = "Pysy online-tilassa";
"STATE_CONNECTED_EXTENDING_BUTTON" = "Yhdistää uudestaan…";

"STATE_NOCREDIT_SUBHEADER" = "Tarvitset Skype-saldoa, jotta voit maksaa täällä käyttämästäsi Skype WiFi -yhteysajasta.";
"STATE_NOCREDIT_BUTTON" = "Hanki Skype-saldoa";


/* === iPad only === */

"STATE_CHECKINGNETWORK_SHORT" = "Tarkistetaan verkkoa";
"STATE_JOINWIFI_SHORT" = "Ei WiFi-yhteyttä";
"STATE_ALREADYONLINE_SHORT" = "Nettiyhteys toimii jo";
"STATE_GENERALERROR_SHORT" = "Virhe";
"STATE_CONNECT_SHORT" = "Käytettävissä täällä";
"STATE_NOCREDIT_SHORT" = "Ei saldoa";


/* === iPhone/iPad only === */
"TIMEEXPIRE_MINUTES_LEFT_FORMAT" = "%d minuuttia jäljellä";
"TIMEEXPIRE_1MINUTE_LEFT" = "1 minuutti jäljellä";
"TIMEEXPIRE_LESSTHAN_1MINUTE_LEFT" = "Alle minuutti jäljellä";

"APP_NOTIFICATION_EXPIRES_SOON_TITLE" = "Nettiyhteytesi vanhenee pian.";


/* === Standalone clients === */

/* iPhone/iPad */
"LOGIN_SKYPENAME_PLACEHOLDER" = "Skype-nimi";
"LOGIN_PASSWORD_PLACEHOLDER" = "Salasana";
"LOGIN_BUTTON" = "Kirjaudu";
"SIGN_OUT_BUTTON" = "Kirjaudu ulos";

/* unused */
"LOGIN_PROBLEMS" = "Kirjautumisongelmia?";
"LOGIN_CREATE_ACCOUNT" = "Luo tili";

/* iPhone/iPad */
"SETTINGS_TITLE" = "Asetukset";
/* unused */
"SETTINGS_BUTTON" = "Asetukset";

/* iPhone/iPad */
"ABOUT_VERSION_FORMAT" = "Skype WiFi -versio %1$@ (%2$@)";
"ABOUT_COPYRIGHT_FORMAT" = "© %1$d–%2$d Skype ja/tai Microsoft";
"ABOUT_PATENTPENDING" = "Patentti vireillä";
"ABOUT_FEEDBACK_BUTTON" = "Palaute";
"ABOUT_LEGAL_BUTTON" = "Lakiasiat";
"ABOUT_TRADEMARK" = "Nimi Skype, siihen liittyvät tavaramerkit ja logot sekä \"S\"-logo ovat Skypen tavaramerkkejä.";
"ABOUT_DISCLAIMER" = "Varoitus: Tämä ohjelma on suojattu tekijänoikeuslaeilla ja kansainvälisillä sopimuksilla. Tämän ohjelman tai jonkin sen osan luvaton kopiointi ja jakelu voi johtaa ankariin rikos- tai siviilioikeudellisiin rangaistuksiin. Rikkomukset aiheuttavat syytteen nostamisen lain ankarimman kirjaimen mukaisesti.";

/* unused */
"PROFILE_BUTTON" = "Profiili";
/* iPhone/iPad */
"PROFILE_SKYPENAME" = "Skype-nimi";
"PROFILE_SKYPECREDIT" = "Skype-saldo";
"PROFILE_SKYPECREDIT_NA_VALUE" = "-";
"PROFILE_SKYPECREDIT_LOADING_VALUE" = "Ladataan…";

/* iPhone/iPad */
"USAGE_HOTSPOTSVISITED" = "Käytetyt hotspotit";
"USAGE_PREVIOUSCONNECTIONS" = "Edelliset yhteydet";
"USAGE_LASTUSED" = "Viimeksi käytetty";
"USAGE_LASTUSED_NEVER_VALUE" = "Ei koskaan";

/* unused - "<date> on <hotspot name>" */
"USAGE_LASTUSED_WHENWHERE_VALUE_FORMAT" = "%1$@, %2$@";
/* unused */
"SUPPORTEDNETWORKS_POPULARLOCATIONS" = "Suositut sijainnit";
"SUPPORTEDNETWORKS_PROVIDERS" = "Yhteydentarjoajat";
